app/controllers/assignors_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    # get the user and a list of games that they can bid on
    # also get a list of their bids so we can put in what
    # they've bid on already
    @user = User.find_by_id( session[:user] )