app/controllers/fields_controller.rb

SELECT * FROM "fields"
---
  def index
    @fields = Field.all