app/controllers/games_controller.rb

SELECT * FROM "games"
---
  def index
    @games = Game.all