app/controllers/user_controller.rb

  def destroy
      @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def edit
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def update
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1